/****************************************************************
* 機　能： オブジェクトの左位置を取得
* 引　数： オブジェクト
* 戻り値： 左からのピクセル数
****************************************************************/
function GetLeft(oj){
    var px = 0;
    while(oj){
        px += oj.offsetLeft;
        oj = oj.offsetParent;
    }
    return px;
}

/****************************************************************
* 機　能： オブジェクトの上位置を取得
* 引　数： オブジェクト
* 戻り値： 上からのピクセル数
****************************************************************/
function GetTop(oj){
    var px = 0;
    while(oj){
        px += oj.offsetTop;
        oj = oj.offsetParent;
    }
    return px;
}
       